Revit 2027 API
ParameterTypeId.CouplerMainBarSize Property
 "Bar Size 1"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId CouplerMainBarSize { get; }
Public Shared ReadOnly Property CouplerMainBarSize As ForgeTypeId
	Get
public:
static property ForgeTypeId^ CouplerMainBarSize {
	ForgeTypeId^ get ();
}
static member CouplerMainBarSize : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace